# Encoding Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GBXMLExportOptions..::..Encoding Property
GBXMLExportOptions Class See Also
---
The encoding options to go into the processing instruction for the exported gbXML file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public string Encoding { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Encoding As String
	Get
```

Visual C++
---
```text
public:
property String^ Encoding {
	String^ get ();
}
```

# See Also
GBXMLExportOptions Class
Autodesk.Revit.DB Namespace